
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");
	Поля.Добавить("ЭтоГруппа");
	Поля.Добавить("Родитель");
	Поля.Добавить("Основание");
КонецПроцедуры 


Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Данные.ЭтоГруппа = Ложь Тогда
		 Представление = СтрШаблон ("%1 (%2)", Данные.Наименование, Данные.Родитель);
	 Иначе 
		 Представление = Данные.Наименование;
	КонецЕсли;
КонецПроцедуры

