
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетНаОплату") Тогда
		// Заполнение шапки
		ИтоговаяСумма = ДанныеЗаполнения.ИтоговаяСумма;
		Поставщик = ДанныеЗаполнения.Поставщик;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр БухгалтерскиеПроводки 
	Движения.БухгалтерскиеПроводки.Записывать = Истина;
	Движение = Движения.БухгалтерскиеПроводки.Добавить();
	Движение.СчетДт = ПланыСчетов.ПланыСчетовБухгалтерии.Касса;
	Движение.СчетКт = ПланыСчетов.ПланыСчетовБухгалтерии.Покупатели;
	Движение.Период = Дата;
	Движение.Сумма = ИтоговаяСумма;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
