&НаКлиенте
АСИНХ Функция ПолучитьИмяЗагружаемгоФайлаАсинх() Экспорт 
Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Проводник.ПроверятьСуществованиеФайла = Истина;
	Результат = ЖДАТЬ Проводник.ВыбратьАсинх();
	Если Результат = Неопределено Тогда
		Возврат "";
	Иначе
		Возврат Проводник.ПолноеИмяФайла;
	КонецЕсли;
КонецФункции // ПолучитьИмяЗагружаемгоФайлаАсинх()

&НаКлиенте
АСИНХ Функция ПолучитьИмяСохраняемогоФайлаАсинх()Экспорт
	Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Результат = ЖДАТЬ Проводник.ВыбратьАсинх();
	Если Результат = Неопределено Тогда
		Возврат "";
	Иначе
		Возврат Проводник.ПолноеИмяФайла;
	КонецЕсли;
КонецФункции // ПолучитьИмяСохраняемогоФайлаАсинх()

&НаКлиенте
АСИНХ Функция ПолучитьОписаниеФайлаАсинх(ПутьКФайлу)  Экспорт
	Файл =Новый Файл(ПутьКФайлу);
	ОписаниеФайла = Новый Структура("Размер, Расширение");
	Если ЖДАТЬ Файл.СуществуетАсинх() Тогда
		ОписаниеФайла.Размер = ЖДАТЬ Файл.РазмерАсинх();
		ОписаниеФайла.Расширение = Файл.Расширение;
	Иначе
		СтрокаВывода = СтрШаблон("Файла ""%1"" не существует!", ПутьКФайлу);
		Сообщить(СтрокаВывода);
	КонецЕсли;
	Возврат ОписаниеФайла;
КонецФункции // ПолучитьОписаниеФайлаАсинх()








