    Функция ДанныеОрганизацииЗаполнены() Экспорт
	
	//Чтение значений констант
	ГенеральныйДиректор_Значение 	= Константы.ГенеральныйДиректор.Получить();
	ИНН_Значение 					= Константы.ИНН.Получить();
	НазваниеОрганизации_Значение 	= Константы.ЮридическоеНаименованиеОрганизации.Получить();
	
	//Проверяем значения констант на заполненность
	НазваниеОрганизации_Заполнено 	= НЕ ПустаяСтрока(НазваниеОрганизации_Значение);
	ИНН_Заполнено					= (ИНН_Значение <> 0);
	ГенеральныйДиректор_Заполнено	= (НазваниеОрганизации_Значение <> Справочники.Сотрудники.ПустаяСсылка());
	
	//Формируем ответ функции
	ВОзврат НазваниеОрганизации_Заполнено И ИНН_Заполнено И ГенеральныйДиректор_Заполнено;
	
	
КонецФункции 