 
//#Область ОписаниеПеременных

//Перем ИмяПользователя;

//#КонецОбласти


#Область ОбработчикиСобытий

//Ctrl+Alt+P - показать список "Процедуры и функции"

Процедура ПриНачалеРаботыСистемы()
	
	ПроверкаДанныхОрганизацииАсинх();
	ОбновлениеКартинки();
	
	//УКЗ_Клиент.СформироватьМассив();	
	//УКЗ_Клиент.СформироватьСтруктуру(); 
	//УКЗ_Клиент.СформироватьМассивСтруктур(); 
	//УКЗ_Клиент.ВыбратьДеньНеделиАсинх();
	//УКЗ_Клиент.ЗадатьВопросАсинх();
	
	//УКЗ_ВызовСервера.СформироватьТаблицуЗначений();
	
	//СказатьПривет();
	
КонецПроцедуры



АСИНХ Процедура ПроверкаДанныхОрганизацииАсинх()
	
	ДанныеЗаполнены = РаботаСКонстантамиВызовСервера.ДанныеОрганизацииЗаполнены();
	
	//Если ДанныеЗаполнены = Ложь Тогда
	Если Не ДанныеЗаполнены Тогда
		
		ЖДАТЬ ПредупреждениеАсинх("Заполните данные организации!", 5, "Данные не заполнены!");
		ОткрытьФорму("ОбщаяФорма.ДанныеОрганизации");
		
	КонецЕсли;
	
КонецПроцедуры 

Процедура ОбновлениеКартинки()

	

КонецПроцедуры




//АСИНХ Процедура СказатьПривет()
//	
//	ИмяПользователя = ЖДАТЬ ВвестиСтрокуАсинх(ИмяПользователя, "Как вас зовут");	
//	ПредупреждениеАсинх("Привет, пользователь" + ИмяПользователя + "!",, "Приветствие");  
//	
//КонецПроцедуры


#КонецОбласти
