
&НаКлиенте
Процедура СписокМатериаловЦенаПриИзменении(Элемент)
	РасчетСтрокиМатериалы();
КонецПроцедуры

&НаКлиенте
Процедура СписокМатериаловКоличествоПриИзменении(Элемент)
	РасчетСтрокиМатериалы();
КонецПроцедуры


&НаКлиенте
Процедура РасчетСтрокиМатериалы()
	
	СтрокаРасчета = Элементы.СписокМатериалов.ТекущиеДанные;
	Если  СтрокаРасчета.ПроцентСкидки > 0 Тогда	
		СтрокаРасчета.Сумма = (СтрокаРасчета.Цена * СтрокаРасчета.Количество)-(СтрокаРасчета.Цена * СтрокаРасчета.Количество * СтрокаРасчета.ПроцентСкидки / 100)
	Иначе
		СтрокаРасчета.Сумма = СтрокаРасчета.Цена * СтрокаРасчета.Количество
	КонецЕсли
	
КонецПроцедуры 


&НаКлиенте
Процедура СписокМатериаловПроцентСкидкиПриИзменении(Элемент)
	РасчетСтрокиМатериалы();
КонецПроцедуры

&НаКлиенте
Процедура СписокМатериаловМатериалПриИзменении(Элемент)
	СтрокаРасчета = Элементы.СписокМатериалов.ТекущиеДанные;
	СтрокаРасчета.Цена= ПоулчитьАктуальнуюЦенуНоменклатуры(СтрокаРасчета.Материал, Объект.Дата);
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПоулчитьАктуальнуюЦенуНоменклатуры(Номенклатура, ПериодОтбора);
	Возврат РегистрыСведений.ЦеныНоменклатуры.ПолучитьАктуальнуюЦену(Номенклатура, ПериодОтбора);
КонецФункции // ПоулчитьАктуальнуюЦенуНоменклатуры()


&НаКлиенте
Процедура СписокУслугиУслугаПриИзменении(Элемент)
	СтрокаРасчета = Элементы.СписокУслуги.ТекущиеДанные;
	СтрокаРасчета.Сумма =  ПоулчитьАктуальнуюЦенуНоменклатуры(СтрокаРасчета.Услуга, Объект.Дата);
КонецПроцедуры


