
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		ЭтотОбъект.ИтоговаяСумма = ЭтотОбъект.СписокМатериалов.Итог("Сумма") + ЭтотОбъект.СписокРасходников.Итог("Сумма");
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказыПоставщику") Тогда
		// Заполнение шапки
		Договор = ДанныеЗаполнения.Договор;
		ИтоговаяСумма = ДанныеЗаполнения.ИтоговаяСумма;
		Поставщик = ДанныеЗаполнения.Поставщик;
		Основание = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаСписокМатериалов Из ДанныеЗаполнения.СписокМатериалов Цикл
			НоваяСтрока = СписокМатериалов.Добавить();
			НоваяСтрока.Количество = ТекСтрокаСписокМатериалов.Количество;
			НоваяСтрока.Материал = ТекСтрокаСписокМатериалов.Материал;
			НоваяСтрока.Сумма = ТекСтрокаСписокМатериалов.Сумма;
			НоваяСтрока.Цена = ТекСтрокаСписокМатериалов.Цена;
		КонецЦикла;
		Для Каждого ТекСтрокаСписокРасходников Из ДанныеЗаполнения.СписокРасходников Цикл
			НоваяСтрока = СписокРасходников.Добавить();
			НоваяСтрока.Количество = ТекСтрокаСписокРасходников.Количество;
			НоваяСтрока.Расходник = ТекСтрокаСписокРасходников.Расходник;
			НоваяСтрока.Сумма = ТекСтрокаСписокРасходников.Сумма;
			НоваяСтрока.Цена = ТекСтрокаСписокРасходников.Цена;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиНоменклатуры Приход
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаСписокМатериалов Из СписокМатериалов Цикл
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаСписокМатериалов.Материал;
		Движение.Количество = ТекСтрокаСписокМатериалов.Количество;
		Движение.Склад = ЭтотОбъект.Склад;
	КонецЦикла;

	// регистр ОстаткиНоменклатуры Приход
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаСписокРасходников Из СписокРасходников Цикл
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаСписокРасходников.Расходник;
		Движение.Количество = ТекСтрокаСписокРасходников.Количество;
		Движение.Склад = ЭтотОбъект.Склад;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

	
#КонецОбласти