
&НаКлиенте
Процедура СписокМатериаловЦенаПриИзменении(Элемент)
	РасчетСтрокиМатериалы();
КонецПроцедуры

&НаКлиенте
Процедура СписокМатериаловКоличествоПриИзменении(Элемент)
	РасчетСтрокиМатериалы();
КонецПроцедуры


&НаКлиенте
Процедура РасчетСтрокиМатериалы()
	
	СтрокаРасчета = Элементы.СписокМатериалов.ТекущиеДанные;
	Если  СтрокаРасчета.ПроцентСкидки > 0 Тогда	
		СтрокаРасчета.Сумма = (СтрокаРасчета.Цена * СтрокаРасчета.Количество) - (СтрокаРасчета.Цена * СтрокаРасчета.Количество * СтрокаРасчета.ПроцентСкидки / 100)
	Иначе
		СтрокаРасчета.Сумма = СтрокаРасчета.Цена * СтрокаРасчета.Количество
	КонецЕсли
	
КонецПроцедуры 


&НаКлиенте
Процедура СписокМатериаловПроцентСкидкиПриИзменении(Элемент)
	РасчетСтрокиМатериалы();
КонецПроцедуры
