
&НаКлиенте
Процедура ОбработкаКоманды(ДоговорСсылка, ПараметрыВыполненияКоманды)
	АдресФайлаВХранилище = ПолучитьАдресФайлаВХранилище(ДоговорСсылка);
	Если ПустаяСтрока(АдресФайлаВХранилище) Тогда
		ПредупреждениеАсинх("За данным договором не закреплен файл",5,"Нет Файла");
	Иначе 
		ПолучитьФайлНаКлиентеАсинх(АдресФайлаВХранилище);
	КонецЕсли;
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Справочник.ДоговорыСКонтрагентами.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

&НаКлиенте
АСИНХ Процедура ПолучитьФайлНаКлиентеАсинх (АдресФайлаВХранилище)
	ИмяФайла = ЖДАТЬ РаботаСФайламиКлиент.ПолучитьИмяСохраняемогоФайлаАсинх();
	Если ПустаяСтрока(ИмяФайла) =Ложь Тогда
		Ждать ПолучитьФайлССервераАсинх(АдресФайлаВХранилище, ИмяФайла);
		ЗапуститьПриложениеАсинх(ИмяФайла);
	КонецЕсли;
КонецПроцедуры

&НаСервере	
Функция ПолучитьАдресФайлаВХранилище(ДоговорСсылка)
	ДанныеФайла = РегистрыСведений.Файлы.ПолучитьДанныеФайла(ДоговорСсылка);
	Если ДанныеФайла = Неопределено Тогда
		Возврат "";
	Иначе
		АдресФайлаВХранилище = ПоместитьВоВременноеХранилище(ДанныеФайла);
		Возврат АдресФайлаВХранилище;
	КонецЕсли;
КонецФункции // ПолучитьАдресФайлаВХранилище()
