Функция ПолучитьОклад(СотрудникОтбора, ПериодОтбора) Экспорт
       Запрос = Новый Запрос();
	   Запрос.Текст = 
	   "ВЫБРАТЬ
	   |	ОкладыСотрудниковСрезПоследних.Оклад КАК Оклад
	   |ИЗ
	   |	РегистрСведений.ОкладыСотрудников.СрезПоследних(&ДатаОтбора, Сотрудник = &Сотрудник) КАК ОкладыСотрудниковСрезПоследних";
	   Запрос.УстановитьПараметр("ДатаОтбора", ПериодОтбора);
	   Запрос.УстановитьПараметр("Сотрудник", СотрудникОтбора);
	   РезультатЗапроса = Запрос.Выполнить();
	   Если РезультатЗапроса.Пустой() Тогда
		   ОкладСотрудника = 0;
	   Иначе
		   ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		   ВыборкаДетальныеЗаписи.Следующий();
		   ОкладСотрудника = ВыборкаДетальныеЗаписи.Оклад;
	   КонецЕсли;
	   Возврат ОкладСотрудника;
КонецФункции // ПолучитьОклад()
