&НаСервере
Функция ЗаписатьКартинкуНаСервер(ЭтотОбъект)  Экспорт

	 //	Если ЭтоАдресВременногоХранилища(АдресКартинкиВХранилище) Тогда
		ДанныеКартинки = ПолучитьИзВременногоХранилища(ЭтотОбъект.АдресКартинкиВХранилище);
//		Если ДанныеКартинки = Неопределено Тогда
//			Сообщить ("При сохранении произошла ошибка");
//		Иначе
//			РегистрыСведений.Файлы.ЗаписьФайлаВбазу(ТекущийОбъект.Ссылка, ДанныеКартинки,ЭтотОбъект.РасширениеФайлаКартинки,ЭтотОбъект.РазмерФайлаКартинки);
//		КонецЕсли;
//	КонецЕсли;
	Сообщить(ДанныеКартинки); 

КонецФункции