Функция ПроверитьОтрицательныеОстатки(СсылкаРН, ДатаОтбора, Склад) Экспорт
	
	ГраницаОтбора = Новый Граница(ДатаОтбора, ВидГраницы.Включая); 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(
		|			&ДатаОтбора,
		|			Склад=&СкладОтбора 
		|			И Номенклатура В
		|				(ВЫБРАТЬ
		|					РасходнаяНакладнаяСписокМатериалов.Материал КАК Материал
		|				ИЗ
		|					Документ.РасходнаяНакладная.СписокМатериалов КАК РасходнаяНакладнаяСписокМатериалов
		|				ГДЕ
		|					РасходнаяНакладнаяСписокМатериалов.Ссылка = &СсылкаРН)) КАК ОстаткиНоменклатурыОстатки
		|ГДЕ
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("ДатаОтбора", ГраницаОтбора);
	Запрос.УстановитьПараметр("СсылкаРН", СсылкаРН);
	Запрос.УстановитьПараметр("СкладОтбора", Склад);	
	РезультатЗапроса = Запрос.Выполнить();

	Если Результатзапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаВывода = СтрШаблон("Не хватает товара ""%1"" в количетсве %2шт.",
		ВыборкаДетальныеЗаписи.Номенклатура, ВыборкаДетальныеЗаписи.КоличествоОстаток);
		Сообщить (СтрокаВывода);
	КонецЦикла; 
	Возврат Истина;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	

КонецФункции // ПроверитьОтрицательныеОстатки() 


Функция ПроверитьОтрицательныеОстаткиСырья(СсылкаПТ, ДатаОтбора,Склад) Экспорт
	ГраницаОтбора = Новый Граница(ДатаОтбора, ВидГраницы.Включая); 
	Запрос = Новый Запрос;
	Запрос.Текст = 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(
		|			&ДатаОтбора,
		|			Склад = &СкладОтбора
		|				И Номенклатура В
		|					(ВЫБРАТЬ
		|						ПроизводствоПродукцииСписокМатериалов.Материал КАК Материал
		|					ИЗ
		|						Документ.ПроизводствоПродукции.СписокМатериалов КАК ПроизводствоПродукцииСписокМатериалов
		|					ГДЕ
		|						ПроизводствоПродукцииСписокМатериалов.Ссылка = &СсылкаПТ)) КАК ОстаткиНоменклатурыОстатки
		|ГДЕ
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("ДатаОтбора", ДатаОтбора);
	Запрос.УстановитьПараметр("СсылкаПТ", СсылкаПТ);
	Запрос.УстановитьПараметр("СкладОтбора", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Результатзапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаВывода = СтрШаблон("Не хватает товара ""%1"" в количетсве %2шт.",
		ВыборкаДетальныеЗаписи.Номенклатура, ВыборкаДетальныеЗаписи.КоличествоОстаток);
		Сообщить (СтрокаВывода);
	КонецЦикла;
	Возврат Истина;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


	

КонецФункции // ПроверитьОтрицательныеОстатки()
