
&НаКлиенте
АСИНХ Процедура ОбработкаКоманды(ДоговорСсылка, ПараметрыВыполненияКоманды)
	ИмяПрикрепляемогоФайла = ЖДАТЬ РаботаСФайламиКлиент.ПолучитьИмяЗагружаемгоФайлаАсинх();
	Если ПустаяСтрока(ИмяПрикрепляемогоФайла) = Ложь Тогда
		ОписаниеФайла = ЖДАТЬ РаботаСФайламиКлиент.ПолучитьОписаниеФайлаАсинх(ИмяПрикрепляемогоФайла);
		ПомещаемыйФайл = ЖДАТЬ ПоместитьФайлНаСерверАсинх(,,,ИмяПрикрепляемогоФайла);
		АдресФайлаВХранилище = ПомещаемыйФайл.Адрес;
		ПрикрепитьДоговор(ДоговорСсылка,АдресФайлаВХранилище,ОписаниеФайла);
		ПредупреждениеАсинх("",5,"Файл успешно прикреплен!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПрикрепитьДоговор(ДоговорСсылка, АдресФайлаВХранилище,ОписаниеФайла)
	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайлаВХранилище);
	РегистрыСведений.Файлы.ЗаписьФайлаВБазу(ДоговорСсылка, ДанныеФайла, ОписаниеФайла.Расширение,ОписаниеФайла.Размер);
КонецПроцедуры
	
