
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Для Каждого СтрокаСотрудника Из ЭтотОбъект.СписокСотрудников Цикл
		СтрокаСотрудника.Оклад = РегистрыСведений.ОкладыСотрудников.ПолучитьОклад(СтрокаСотрудника.Сотрудник, ЭтотОбъект.Дата);
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Зарплата
	Движения.Зарплата.Записывать = Истина;
	Для Каждого ТекСтрокаСписокСотрудников Из СписокСотрудников Цикл
		Движение = Движения.Зарплата.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВидыРасчета.Оклад;
		Движение.ПериодДействияНачало = НачалоМесяца(ЭтотОбъект.Дата);
		Движение.ПериодДействияКонец = КонецМесяца(ЭтотОбъект.Дата);
		Движение.ПериодРегистрации = ЭтотОбъект.Дата;
		Движение.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
		Движение.Оклад = ТекСтрокаСписокСотрудников.Оклад;
	КонецЦикла; 
	Движения.Зарплата.Записать();
	Движения.Зарплата.Рассчитать();

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
